ДО_для_разработки/src/Catalogs/Метрики/Метрики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Метрики</name>
  <predefined>
    <items>
      <name>АктивностьПользователей</name>
      <description>Активность пользователей</description>
    </items>
    <items>
      <name>АктивныеПользователи</name>
      <description>Активные пользователи</description>
    </items>
    <items>
      <name>АктивныеПроцессы</name>
      <description>Активные процессы</description>
    </items>
    <items>
      <name>ДолгаяОчередь</name>
      <description>Долгая очередь</description>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Количество контрагентов</description>
    </items>
    <items>
      <name>Файлы</name>
      <description>Количество файлов</description>
    </items>
    <items>
      <name>НевыполненныеЗадачи</name>
      <description>Невыполненные задачи</description>
    </items>
    <items>
      <name>ОперативнаяОчередь</name>
      <description>Оперативная очередь</description>
    </items>
    <items>
      <name>РазмерФайлов</name>
      <description>Размер файлов (Мб)</description>
    </items>
  </predefined>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗамеров</name>
    <comment>в минутах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйМасштаб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ДО_для_разработки/src/Catalogs/Метрики/ManagerModule.bsl
// Возвращает свойства предопределенных метрик ЧастотаЗамеров и Описание
// 
Функция СвойстваПредопределенныхМетрик() Экспорт
	
	// Заполнение настроек метрик
	СвойстваМетрик = Новый Соответствие;
	СвойстваМетрик.Вставить(Справочники.Метрики.ДолгаяОчередь, 
		Новый Структура("ЧастотаЗамеров, Описание", 10,
			НСтр("ru = 'Количество записей в долгой очереди обновления прав доступа'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.ОперативнаяОчередь, 
		Новый Структура("ЧастотаЗамеров, Описание", 10,
			НСтр("ru = 'Количество записей в оперативной очереди обновления прав доступа'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.АктивныеПользователи, 
		Новый Структура("ЧастотаЗамеров, Описание", 60,
			НСтр("ru = 'Количество одновременно работающих пользователей программы'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.АктивностьПользователей, 
		Новый Структура("ЧастотаЗамеров, Описание", 1440,
			НСтр("ru = 'Количество записей в протоколе работы пользователей за последние сутки'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.АктивныеПроцессы, 
		Новый Структура("ЧастотаЗамеров, Описание", 60,
			НСтр("ru = 'Количество активных процессов'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.НевыполненныеЗадачи, 
		Новый Структура("ЧастотаЗамеров, Описание", 60,
			НСтр("ru = 'Количество невыполненных задач'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.РазмерФайлов, 
		Новый Структура("ЧастотаЗамеров, Описание", 1440,
			НСтр("ru = 'Суммарный размер всех файлов'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.Файлы, 
		Новый Структура("ЧастотаЗамеров, Описание", 1440,
			НСтр("ru = 'Количество файлов'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.Контрагенты, 
		Новый Структура("ЧастотаЗамеров, Описание", 1440,
			НСтр("ru = 'Количество контрагентов'")));
	
	Возврат СвойстваМетрик;
	
КонецФункции
